In [18]:
import pandas
data = pandas.read_csv("data/Mall_Customers.csv")
data

     CustomerID  Gender  Age  Annual Income  Spending Score
0             1    Male   19           15.0            39.0
1             2    Male   21           15.0            81.0
2             3  Female   20           16.0             6.0
3             4  Female   23           16.0            77.0
4             5  Female   31           17.0            40.0
..          ...     ...  ...            ...             ...
195         196  Female   35          120.0            79.0
196         197  Female   45          126.0             NaN
197         198    Male   32          126.0            74.0
198         199    Male   32          137.0            18.0
199         200    Male   30          137.0            83.0

[200 rows x 5 columns]

In [19]:
data["Gender"]

0        Male
1        Male
2      Female
3      Female
4      Female
        ...
195    Female
196    Female
197      Male
198      Male
199      Male
Name: Gender, Length: 200, dtype: object

In [20]:
data["Age"]

0      19
1      21
2      20
3      23
4      31
       ..
195    35
196    45
197    32
198    32
199    30
Name: Age, Length: 200, dtype: int64

In [21]:
data["Annual Income"]

0       15.0
1       15.0
2       16.0
3       16.0
4       17.0
       ...
195    120.0
196    126.0
197    126.0
198    137.0
199    137.0
Name: Annual Income, Length: 200, dtype: float64

In [22]:
data["CustomerID"]

0        1
1        2
2        3
3        4
4        5
      ...
195    196
196    197
197    198
198    199
199    200
Name: CustomerID, Length: 200, dtype: int64

In [23]:
data["Spending Score"]

0      39.0
1      81.0
2       6.0
3      77.0
4      40.0
       ...
195    79.0
196     NaN
197    74.0
198    18.0
199    83.0
Name: Spending Score, Length: 200, dtype: float64

In [24]:
# check any empties
data.isnull().sum()

CustomerID        0
Gender            4
Age               0
Annual Income     1
Spending Score    3
dtype: int64

In [25]:
# replace empty gender with unknown
data["Gender"].fillna("unknown", inplace= True)

In [26]:
# replace empty annual income with mean
mean = 60.357
data["Annual Income"].fillna(mean, inplace=True)

In [27]:
# replace empty spending score with unknown
mean = 50.325
data["Spending Score"].fillna(mean, inplace=True)

In [28]:
# check any empties
data.isnull().sum()

CustomerID        0
Gender            0
Age               0
Annual Income     0
Spending Score    0
dtype: int64

In [30]:
# describe your data
data.describe()

       CustomerID         Age  Annual Income  Spending Score
count  200.000000  200.000000     200.000000      200.000000
mean   100.500000   38.850000      60.356785       50.324875
std     57.879185   13.969007      26.107015       25.445104
min      1.000000   18.000000      15.000000        1.000000
25%     50.750000   28.750000      41.500000       35.000000
50%    100.500000   36.000000      61.000000       50.000000
75%    150.250000   49.000000      78.000000       72.250000
max    200.000000   70.000000     137.000000       99.000000